examples/coupled_sedifoam_granlammps/test_single_si/openfoam/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version	 2.0;
	format	 ascii;
	class	 dictionary;
	object	 transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

rhoa 			 rhoa [1 -3 0 0 0 0 0] 2650;
rhob 			 rhob [1 -3 0 0 0 0 0] 1000;
nua 			 nua [0 2 -1 0 0 0 0] 1e-06;
nub 			 nub [0 2 -1 0 0 0 0] 1e-06;
da 			 da [0 1 0 0 0 0 0] 0.0005;
//db 			 db [0 1 0 0 0 0 0] NULL;
Cvm 			 Cvm [0 0 0 0 0 0 0] 0.0;
Cl 			 Cl [0 0 0 0 0 0 0] 0.0;
Ct 			 Ct [0 0 0 0 0 0 0] 1.0;
//Ubar 			 Ubar [0 1 -1 0 0 0 0] (NULL NULL NULL);
//gradPbar 			 gradPbar [0 1 -2 0 0 0 0] (NULL NULL NULL);

transportModel 			 Newtonian;
nu 			 nu [0 2 -1 0 0 0 0] 1e-06;
// ************************************************************************* //
