examples/coupled_sedifoam_granlammps/test_single_si/openfoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.05;
    }

    pFinal
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
    }

    U
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0;
    }



// using new solver syntax:
Ua
{
    solver          PBiCG;
    preconditioner  DILU;
    tolerance       1e-05;
    relTol          0;
}

// using new solver syntax:
Ub
{
    solver          PBiCG;
    preconditioner  DILU;
    tolerance       1e-05;
    relTol          0;
}

// using new solver syntax:
alpha
{
    solver          PBiCG;
    preconditioner  DILU;
    tolerance       1e-10;
    relTol          0;
}

tempDiffScalar
{
    solver          PCG;
    preconditioner  DIC;
    tolerance       1e-10;
    relTol          0;
}

tempDiffVector
{
    solver          PCG;
    preconditioner  DIC;
    tolerance       1e-10;
    relTol          0;
}

// using new solver syntax:
beta
{
    solver          PBiCG;
    preconditioner  DILU;
    tolerance       1e-10;
    relTol          0;
}

// using new solver syntax:
k
{
    solver          PBiCG;
    preconditioner  DILU;
    tolerance       1e-05;
    relTol          0;
}

// using new solver syntax:
epsilon
{
    solver          PBiCG;
    preconditioner  DILU;
    tolerance       1e-05;
    relTol          0;
}


 }



PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        10;
    pRefValue       0;
}


SIMPLE
{
    nNonOrthogonalCorrectors 1;
}
// ************************************************************************* //
